---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.CurveArrArray
source: html/e7f95c6e-b20e-513d-b04e-b58550891fd7.htm
---
# CurveArrArray Members

Initializes a new instance of the CurveArrArray class